In [82]:
import pandas as pd
record1 = pd.Series({'Name': 'Alice',
                        'Class': 'Physics',
                        'Score': 85})
record2 = pd.Series({'Name': 'Jack',
                        'Class': 'Chemistry',
                        'Score': 82})
record3 = pd.Series({'Name': 'Helen',
                        'Class': 'Biology',
                        'Score': 90})

In [83]:
df = pd.DataFrame([record1,record2,record3]) # group of series can be pass in an array
df.head()

    Name      Class  Score
0  Alice    Physics     85
1   Jack  Chemistry     82
2  Helen    Biology     90

In [84]:
## An alternative method is that you could use a list of dictionaries, where each dictionary represents a row of data.
students = [{'Name': 'Alice',
              'Class': 'Physics',
              'Score': 85},
            {'Name': 'Jack',
             'Class': 'Chemistry',
             'Score': 82},
            {'Name': 'Helen',
             'Class': 'Biology',
             'Score': 90}]
df= pd.DataFrame(students, index=['school1','school2','school1'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [85]:
#using .loc function
df.loc['school2']

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [86]:
type(df.loc['school2'])

pandas.core.series.Series

In [87]:
# there are two records for school1 as different rows.If we use a single value with the DataFrame lock attribute, 
# multiple rows of the DataFrame will return, not as a new series, but as a new DataFrame.

df.loc['school1']

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [88]:
type(df.loc['school1'])

pandas.core.frame.DataFrame

In [89]:
# data can be selected on the basis of multiple axes
df.loc['school1','Name']

school1    Alice
school1    Helen
Name: Name, dtype: object

In [90]:
# df can be transpose
df.T

       school1    school2  school1
Name     Alice       Jack    Helen
Class  Physics  Chemistry  Biology
Score       85         82       90

In [91]:
df.T.loc['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [92]:
df['Name']

school1    Alice
school2     Jack
school1    Helen
Name: Name, dtype: object

In [93]:
df.loc[:,['Name','Score']]

          Name  Score
school1  Alice     85
school2   Jack     82
school1  Helen     90

In [94]:
df.drop('school2')

          Name    Class  Score
school1  Alice  Physics     85
school1  Helen  Biology     90

In [95]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [96]:
# copy function
copy_df = df.copy()
copy_df.drop('Name', inplace= True, axis = 1) # drop the name column
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [97]:
del copy_df['Class'] # del function
copy_df

         Score
school1     85
school2     82
school1     90

In [98]:
#adding new cloumns
df['ClassRanking'] = None
df

          Name      Class  Score ClassRanking
school1  Alice    Physics     85         None
school2   Jack  Chemistry     82         None
school1  Helen    Biology     90         None

In [99]:
#renaming columns
df = df.rename(columns={'Score':"TotalScore"})
df

          Name      Class  TotalScore ClassRanking
school1  Alice    Physics          85         None
school2   Jack  Chemistry          82         None
school1  Helen    Biology          90         None

In [100]:
df.columns

Index(['Name', 'Class', 'TotalScore', 'ClassRanking'], dtype='object')

In [101]:
#converting all the columns in lowercase using list comprehension
cols = list(df.columns)
cols = [x.lower().strip()for x in cols]
df.columns = cols
df

          name      class  totalscore classranking
school1  Alice    Physics          85         None
school2   Jack  Chemistry          82         None
school1  Helen    Biology          90         None